Revit 2020 API
Application.NewImageImportOptions Method
Creates Image Import options.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2020 and will be removed in the next version of Revit.  ImageImportOptions is replaced by ImageTypeOptions and ImagePlacementOptions")]
public ImageImportOptions NewImageImportOptions()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2020 and will be removed in the next version of Revit.  ImageImportOptions is replaced by ImageTypeOptions and ImagePlacementOptions")> _
Public Function NewImageImportOptions As ImageImportOptions
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2020 and will be removed in the next version of Revit.  ImageImportOptions is replaced by ImageTypeOptions and ImagePlacementOptions")]
public:
ImageImportOptions^ NewImageImportOptions()
See Also
Application Class
Autodesk.Revit.Creation Namespace